using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace ShahadatApp.PrivateClasses
{
    public class Message
    {
        public const  string TmEbla8Msg = "السيد / {{Name}} \n-لقد تم قبول طلبكم رقم {{Talab}} بخصوص ({{ServiceType}})\n   -*{{Message}}* \n \n-لسداد الرسوم فوري يتم الاستعلام من خلال الموقع الالكتروني: \n https://tagned.mod.gov.eg/CertificateSearch.aspx \n و يتم اختيار السداد عن طرق فوري ثم التوجة لاقرب مكينة فوري و ادخال البيانات الاتية:\n كود الخدمه  : 73602 \n رقم الطلب : {{Talab}}\n الرقم القومي : {{Kawmy}}\n\n-فى حالة تقديم  الخدمة من خلال الموقع الالكترونى  يمكنك السداد \nالالكترونى عن طريق الرابط التالى :https://tagned.mod.gov.eg/CertificateSearch.aspx\n-رسوم الخدمة  :\nالشـــــــــهادة الــورقيــــــــة :80 جنيهاً \n-استلام الشهادة من منطقة التجنيد او \nدارة التجنيد يكون بعد يوم واحد عمل من تاريخ سداد الرسوم.\n-من قسم التجنيد بمديرية الأمن يكون بعد ثلاثة ايام عمل من تاريخ سداد الرسوم  \nادارة التجنيد والتعبئة \nالمركز اللإلكتروني لخدمات التجنيد";
        public const string TmDaf3Msg = "السيد / {{Name}}\n-لقد قمت بدفع الرسوم المقررة بخصوص طلب رقم {{Talab}} (شهادة الأعفاء (\nجاري تنفيذ طلبكم برجاء \n سوف يتم ارسال رساله باستلام الخدمة من *{{Place}}* حين تكون الخدمة جاهز للاستلام  برجاء انتظار رساله الاستلام \nادارة التجنيد والتعبئة \nالمركز اللإلكتروني لخدمات التجنيد ";
        public const string El5dmaGahza = "السيد / {{Name}}\nبخصوص طلب استخراج شهادة الاعفاء الخاصة بكم رقم {{Talab}}\nبأمكانكم استلام الخدمة من {{Place}}\n{{Locations}}\nملحوظة اذا تم الاستلام برجاء تجاهل الرسالة\nأدارة التجنيد و التعبئة\nالمركز الإلكتروني لخدمات التجنيد\n";
    }
}